Revit 2026 API

# WorksharedOperationProgressChangedEventArgsLocation Property

---

Full path of the central model which is to be operated.

**Namespace:** Autodesk.Revit.DB.Events**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string Location { get; }
```
```vb
Public ReadOnly Property Location As String
	Get
```
```cpp
public:
property String^ Location {
	String^ get ();
}
```
```fsharp
member Location : string with get
```

#### Property Value

String

For C4R model, it looks like 'Autodesk Docs://My project/my model.rvt'.

#### Reference

WorksharedOperationProgressChangedEventArgs Class

Autodesk.Revit.DB.Events Namespace